// написать программу является ли число четным

Console.Write("Enter number...");
int number = Convert.ToInt32(Console.ReadLine());

if (number % 2 == 0)
{
  Console.WriteLine("NumberYes");
}
 else
 {
     Console.WriteLine("NumberNo");
 }